MightyDevices/startup-stm32l433/stm32l433/rcc.h
/**
 * @file rcc.h
 * 
 * @date 2019-09-12
 * @author twatorowski (tw@mightydevices.com)
 * 
 * @brief STM32 Headers: RCC
 */

#ifndef STM32L433_RCC_H_
#define STM32L433_RCC_H_

#include "stm32l433/stm32l433.h"

/* register base */
#define RCC_BASE                            (0x40021000)
/* rcc itself */
#define RCC                                 ((rcc_t *) RCC_BASE)

/* rcc registers */
typedef struct {
    reg32_t CR;
    reg32_t ICSCR;
    reg32_t CFGR;
    reg32_t PLLCFGR;
    reg32_t PLLSAI1CFGR;
    reg32_t RESERVED0;
    reg32_t CIER;
    reg32_t CIFR;
    reg32_t CICR;
    reg32_t RESERVED1;
    reg32_t AHB1RSTR;
    reg32_t AHB2RSTR;
    reg32_t AHB3RSTR;
    reg32_t RESERVED2;
    reg32_t APB1RSTR1;
    reg32_t APB1RSTR2;
    reg32_t APB2RSTR;
    reg32_t RESERVED3;
    reg32_t AHB1ENR;
    reg32_t AHB2ENR;
    reg32_t AHB3ENR;
    reg32_t RESERVED4;
    reg32_t APB1ENR1;
    reg32_t APB1ENR2;
    reg32_t APB2ENR;
    reg32_t RESERVED5;
    reg32_t AHB1SMENR;
    reg32_t AHB2SMENR;
    reg32_t AHB3SMENR;
    reg32_t RESERVED6;
    reg32_t APB1SMENR1;
    reg32_t APB1SMENR2;
    reg32_t APB2SMENR;
    reg32_t RESERVED7;
    reg32_t CCIPR;
    reg32_t RESERVED8;
    reg32_t BDCR;
    reg32_t CSR;
    reg32_t CRRCR;
    reg32_t CCIPR2;
} PACKED ALIGNED(4) rcc_t;

/*  Bit definition for RCC_CR register  */
#define RCC_CR_MSION                        (0x00000001)
#define RCC_CR_MSIRDY                       (0x00000002)
#define RCC_CR_MSIPLLEN                     (0x00000004)
#define RCC_CR_MSIRGSEL                     (0x00000008)
#define RCC_CR_MSIRANGE                     (0x000000F0)
#define RCC_CR_MSIRANGE_0                   (0x00000000)
#define RCC_CR_MSIRANGE_1                   (0x00000010)
#define RCC_CR_MSIRANGE_2                   (0x00000020)
#define RCC_CR_MSIRANGE_3                   (0x00000030)
#define RCC_CR_MSIRANGE_4                   (0x00000040)
#define RCC_CR_MSIRANGE_5                   (0x00000050)
#define RCC_CR_MSIRANGE_6                   (0x00000060)
#define RCC_CR_MSIRANGE_7                   (0x00000070)
#define RCC_CR_MSIRANGE_8                   (0x00000080)
#define RCC_CR_MSIRANGE_9                   (0x00000090)
#define RCC_CR_MSIRANGE_10                  (0x000000A0)
#define RCC_CR_MSIRANGE_11                  (0x000000B0)
#define RCC_CR_HSION                        (0x00000100)
#define RCC_CR_HSIKERON                     (0x00000200)
#define RCC_CR_HSIRDY                       (0x00000400)
#define RCC_CR_HSIASFS                      (0x00000800)
#define RCC_CR_HSEON                        (0x00010000)
#define RCC_CR_HSERDY                       (0x00020000)
#define RCC_CR_HSEBYP                       (0x00040000)
#define RCC_CR_CSSON                        (0x00080000)
#define RCC_CR_PLLON                        (0x01000000)
#define RCC_CR_PLLRDY                       (0x02000000)
#define RCC_CR_PLLSAI1ON                    (0x04000000)
#define RCC_CR_PLLSAI1RDY                   (0x08000000)

/*  Bit definition for RCC_ICSCR register  */
#define RCC_ICSCR_MSICAL                    (0x000000FF)
#define RCC_ICSCR_MSICAL_0                  (0x00000001)
#define RCC_ICSCR_MSICAL_1                  (0x00000002)
#define RCC_ICSCR_MSICAL_2                  (0x00000004)
#define RCC_ICSCR_MSICAL_3                  (0x00000008)
#define RCC_ICSCR_MSICAL_4                  (0x00000010)
#define RCC_ICSCR_MSICAL_5                  (0x00000020)
#define RCC_ICSCR_MSICAL_6                  (0x00000040)
#define RCC_ICSCR_MSICAL_7                  (0x00000080)
#define RCC_ICSCR_MSITRIM                   (0x0000FF00)
#define RCC_ICSCR_MSITRIM_0                 (0x00000100)
#define RCC_ICSCR_MSITRIM_1                 (0x00000200)
#define RCC_ICSCR_MSITRIM_2                 (0x00000400)
#define RCC_ICSCR_MSITRIM_3                 (0x00000800)
#define RCC_ICSCR_MSITRIM_4                 (0x00001000)
#define RCC_ICSCR_MSITRIM_5                 (0x00002000)
#define RCC_ICSCR_MSITRIM_6                 (0x00004000)
#define RCC_ICSCR_MSITRIM_7                 (0x00008000)
#define RCC_ICSCR_HSICAL                    (0x00FF0000)
#define RCC_ICSCR_HSICAL_0                  (0x00010000)
#define RCC_ICSCR_HSICAL_1                  (0x00020000)
#define RCC_ICSCR_HSICAL_2                  (0x00040000)
#define RCC_ICSCR_HSICAL_3                  (0x00080000)
#define RCC_ICSCR_HSICAL_4                  (0x00100000)
#define RCC_ICSCR_HSICAL_5                  (0x00200000)
#define RCC_ICSCR_HSICAL_6                  (0x00400000)
#define RCC_ICSCR_HSICAL_7                  (0x00800000)
#define RCC_ICSCR_HSITRIM                   (0x1F000000)
#define RCC_ICSCR_HSITRIM_0                 (0x01000000)
#define RCC_ICSCR_HSITRIM_1                 (0x02000000)
#define RCC_ICSCR_HSITRIM_2                 (0x04000000)
#define RCC_ICSCR_HSITRIM_3                 (0x08000000)
#define RCC_ICSCR_HSITRIM_4                 (0x10000000)

/*  Bit definition for RCC_CFGR register  */
#define RCC_CFGR_SW                         (0x00000003)
#define RCC_CFGR_SW_0                       (0x00000001)
#define RCC_CFGR_SW_1                       (0x00000002)
#define RCC_CFGR_SW_MSI                     (0x00000000)
#define RCC_CFGR_SW_HSI                     (0x00000001)
#define RCC_CFGR_SW_HSE                     (0x00000002)
#define RCC_CFGR_SW_PLL                     (0x00000003)
#define RCC_CFGR_SWS                        (0x0000000C)
#define RCC_CFGR_SWS_0                      (0x00000004)
#define RCC_CFGR_SWS_1                      (0x00000008)
#define RCC_CFGR_SWS_MSI                    (0x00000000)
#define RCC_CFGR_SWS_HSI                    (0x00000004)
#define RCC_CFGR_SWS_HSE                    (0x00000008)
#define RCC_CFGR_SWS_PLL                    (0x0000000C)
#define RCC_CFGR_HPRE                       (0x000000F0)
#define RCC_CFGR_HPRE_0                     (0x00000010)
#define RCC_CFGR_HPRE_1                     (0x00000020)
#define RCC_CFGR_HPRE_2                     (0x00000040)
#define RCC_CFGR_HPRE_3                     (0x00000080)
#define RCC_CFGR_HPRE_DIV1                  (0x00000000)
#define RCC_CFGR_HPRE_DIV2                  (0x00000080)
#define RCC_CFGR_HPRE_DIV4                  (0x00000090)
#define RCC_CFGR_HPRE_DIV8                  (0x000000A0)
#define RCC_CFGR_HPRE_DIV16                 (0x000000B0)
#define RCC_CFGR_HPRE_DIV64                 (0x000000C0)
#define RCC_CFGR_HPRE_DIV128                (0x000000D0)
#define RCC_CFGR_HPRE_DIV256                (0x000000E0)
#define RCC_CFGR_HPRE_DIV512                (0x000000F0)
#define RCC_CFGR_PPRE1                      (0x00000700)
#define RCC_CFGR_PPRE1_0                    (0x00000100)
#define RCC_CFGR_PPRE1_1                    (0x00000200)
#define RCC_CFGR_PPRE1_2                    (0x00000400)
#define RCC_CFGR_PPRE1_DIV1                 (0x00000000)
#define RCC_CFGR_PPRE1_DIV2                 (0x00000400)
#define RCC_CFGR_PPRE1_DIV4                 (0x00000500)
#define RCC_CFGR_PPRE1_DIV8                 (0x00000600)
#define RCC_CFGR_PPRE1_DIV16                (0x00000700)
#define RCC_CFGR_PPRE2                      (0x00003800)
#define RCC_CFGR_PPRE2_0                    (0x00000800)
#define RCC_CFGR_PPRE2_1                    (0x00001000)
#define RCC_CFGR_PPRE2_2                    (0x00002000)
#define RCC_CFGR_PPRE2_DIV1                 (0x00000000)
#define RCC_CFGR_PPRE2_DIV2                 (0x00002000)
#define RCC_CFGR_PPRE2_DIV4                 (0x00002800)
#define RCC_CFGR_PPRE2_DIV8                 (0x00003000)
#define RCC_CFGR_PPRE2_DIV16                (0x00003800)
#define RCC_CFGR_STOPWUCK                   (0x00008000)
#define RCC_CFGR_MCOSEL                     (0x07000000)
#define RCC_CFGR_MCOSEL_0                   (0x01000000)
#define RCC_CFGR_MCOSEL_1                   (0x02000000)
#define RCC_CFGR_MCOSEL_2                   (0x04000000)
#define RCC_CFGR_MCOPRE                     (0x70000000)
#define RCC_CFGR_MCOPRE_0                   (0x10000000)
#define RCC_CFGR_MCOPRE_1                   (0x20000000)
#define RCC_CFGR_MCOPRE_2                   (0x40000000)
#define RCC_CFGR_MCOPRE_DIV1                (0x00000000)
#define RCC_CFGR_MCOPRE_DIV2                (0x10000000)
#define RCC_CFGR_MCOPRE_DIV4                (0x20000000)
#define RCC_CFGR_MCOPRE_DIV8                (0x30000000)
#define RCC_CFGR_MCOPRE_DIV16               (0x40000000)

/*  Bit definition for RCC_PLLCFGR register  */
#define RCC_PLLCFGR_PLLSRC                  (0x00000003)
#define RCC_PLLCFGR_PLLSRC_MSI              (0x00000001)
#define RCC_PLLCFGR_PLLSRC_HSI              (0x00000002)
#define RCC_PLLCFGR_PLLSRC_HSE              (0x00000003)
#define RCC_PLLCFGR_PLLM                    (0x00000070)
#define RCC_PLLCFGR_PLLM_0                  (0x00000010)
#define RCC_PLLCFGR_PLLM_1                  (0x00000020)
#define RCC_PLLCFGR_PLLM_2                  (0x00000040)
#define RCC_PLLCFGR_PLLN                    (0x00007F00)
#define RCC_PLLCFGR_PLLN_0                  (0x00000100)
#define RCC_PLLCFGR_PLLN_1                  (0x00000200)
#define RCC_PLLCFGR_PLLN_2                  (0x00000400)
#define RCC_PLLCFGR_PLLN_3                  (0x00000800)
#define RCC_PLLCFGR_PLLN_4                  (0x00001000)
#define RCC_PLLCFGR_PLLN_5                  (0x00002000)
#define RCC_PLLCFGR_PLLN_6                  (0x00004000)
#define RCC_PLLCFGR_PLLPEN                  (0x00010000)
#define RCC_PLLCFGR_PLLP                    (0x00020000)
#define RCC_PLLCFGR_PLLQEN                  (0x00100000)
#define RCC_PLLCFGR_PLLQ                    (0x00600000)
#define RCC_PLLCFGR_PLLQ_0                  (0x00200000)
#define RCC_PLLCFGR_PLLQ_1                  (0x00400000)
#define RCC_PLLCFGR_PLLREN                  (0x01000000)
#define RCC_PLLCFGR_PLLR                    (0x06000000)
#define RCC_PLLCFGR_PLLR_0                  (0x02000000)
#define RCC_PLLCFGR_PLLR_1                  (0x04000000)
#define RCC_PLLCFGR_PLLPDIV                 (0xF8000000)
#define RCC_PLLCFGR_PLLPDIV_0               (0x08000000)
#define RCC_PLLCFGR_PLLPDIV_1               (0x10000000)
#define RCC_PLLCFGR_PLLPDIV_2               (0x20000000)
#define RCC_PLLCFGR_PLLPDIV_3               (0x40000000)
#define RCC_PLLCFGR_PLLPDIV_4               (0x80000000)

/*  Bit definition for RCC_PLLSAI1CFGR register  **/
#define RCC_PLLSAI1CFGR_PLLSAI1N            (0x00007F00)
#define RCC_PLLSAI1CFGR_PLLSAI1N_0          (0x00000100)
#define RCC_PLLSAI1CFGR_PLLSAI1N_1          (0x00000200)
#define RCC_PLLSAI1CFGR_PLLSAI1N_2          (0x00000400)
#define RCC_PLLSAI1CFGR_PLLSAI1N_3          (0x00000800)
#define RCC_PLLSAI1CFGR_PLLSAI1N_4          (0x00001000)
#define RCC_PLLSAI1CFGR_PLLSAI1N_5          (0x00002000)
#define RCC_PLLSAI1CFGR_PLLSAI1N_6          (0x00004000)
#define RCC_PLLSAI1CFGR_PLLSAI1PEN          (0x00010000)
#define RCC_PLLSAI1CFGR_PLLSAI1P            (0x00020000)
#define RCC_PLLSAI1CFGR_PLLSAI1QEN          (0x00100000)
#define RCC_PLLSAI1CFGR_PLLSAI1Q            (0x00600000)
#define RCC_PLLSAI1CFGR_PLLSAI1Q_0          (0x00200000)
#define RCC_PLLSAI1CFGR_PLLSAI1Q_1          (0x00400000)
#define RCC_PLLSAI1CFGR_PLLSAI1REN          (0x01000000)
#define RCC_PLLSAI1CFGR_PLLSAI1R            (0x06000000)
#define RCC_PLLSAI1CFGR_PLLSAI1R_0          (0x02000000)
#define RCC_PLLSAI1CFGR_PLLSAI1R_1          (0x04000000)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV         (0xF8000000)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_0       (0x08000000)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_1       (0x10000000)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_2       (0x20000000)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_3       (0x40000000)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_4       (0x80000000)

/*  Bit definition for RCC_CIER register  */
#define RCC_CIER_LSIRDYIE                   (0x00000001)
#define RCC_CIER_LSERDYIE                   (0x00000002)
#define RCC_CIER_MSIRDYIE                   (0x00000004)
#define RCC_CIER_HSIRDYIE                   (0x00000008)
#define RCC_CIER_HSERDYIE                   (0x00000010)
#define RCC_CIER_PLLRDYIE                   (0x00000020)
#define RCC_CIER_PLLSAI1RDYIE               (0x00000040)
#define RCC_CIER_PLLSAI2RDYIE               (0x00000080)
#define RCC_CIER_LSECSSIE                   (0x00000200)
#define RCC_CIER_HSI48RDYIE                 (0x00000400)

/*  Bit definition for RCC_CIFR register  */
#define RCC_CIFR_LSIRDYF                    (0x00000001)
#define RCC_CIFR_LSERDYF                    (0x00000002)
#define RCC_CIFR_MSIRDYF                    (0x00000004)
#define RCC_CIFR_HSIRDYF                    (0x00000008)
#define RCC_CIFR_HSERDYF                    (0x00000010)
#define RCC_CIFR_PLLRDYF                    (0x00000020)
#define RCC_CIFR_PLLSAI1RDYF                (0x00000040)
#define RCC_CIFR_PLLSAI2RDYF                (0x00000080)
#define RCC_CIFR_CSSF                       (0x00000100)
#define RCC_CIFR_LSECSSF                    (0x00000200)
#define RCC_CIFR_HSI48RDYF                  (0x00000400)

/*  Bit definition for RCC_CICR register  */
#define RCC_CICR_LSIRDYC                    (0x00000001)
#define RCC_CICR_LSERDYC                    (0x00000002)
#define RCC_CICR_MSIRDYC                    (0x00000004)
#define RCC_CICR_HSIRDYC                    (0x00000008)
#define RCC_CICR_HSERDYC                    (0x00000010)
#define RCC_CICR_PLLRDYC                    (0x00000020)
#define RCC_CICR_PLLSAI1RDYC                (0x00000040)
#define RCC_CICR_PLLSAI2RDYC                (0x00000080)
#define RCC_CICR_CSSC                       (0x00000100)
#define RCC_CICR_LSECSSC                    (0x00000200)
#define RCC_CICR_HSI48RDYC                  (0x00000400)

/*  Bit definition for RCC_AHB1RSTR register  */
#define RCC_AHB1RSTR_DMA1RST                (0x00000001)
#define RCC_AHB1RSTR_DMA2RST                (0x00000002)
#define RCC_AHB1RSTR_FLASHRST               (0x00000100)
#define RCC_AHB1RSTR_CRCRST                 (0x00001000)
#define RCC_AHB1RSTR_TSCRST                 (0x00010000)

