MightyDevices/startup-stm32l433/stm32l433/rcc.h
/*  Bit definition for RCC_AHB2RSTR register  */
#define RCC_AHB2RSTR_GPIOARST               (0x00000001)
#define RCC_AHB2RSTR_GPIOBRST               (0x00000002)
#define RCC_AHB2RSTR_GPIOCRST               (0x00000004)
#define RCC_AHB2RSTR_GPIODRST               (0x00000008)
#define RCC_AHB2RSTR_GPIOERST               (0x00000010)
#define RCC_AHB2RSTR_GPIOFRST               (0x00000020)
#define RCC_AHB2RSTR_GPIOGRST               (0x00000040)
#define RCC_AHB2RSTR_GPIOHRST               (0x00000080)
#define RCC_AHB2RSTR_OTGFSRST               (0x00001000)
#define RCC_AHB2RSTR_ADCRST                 (0x00002000)
#define RCC_AHB2RSTR_RNGRST                 (0x00040000)

/*  Bit definition for RCC_AHB3RSTR register  */
#define RCC_AHB3RSTR_FMCRST                 (0x00000001)
#define RCC_AHB3RSTR_QSPIRST                (0x00000100)

/*  Bit definition for RCC_APB1RSTR1 register  */
#define RCC_APB1RSTR1_TIM2RST               (0x00000001)
#define RCC_APB1RSTR1_TIM3RST               (0x00000002)
#define RCC_APB1RSTR1_TIM4RST               (0x00000004)
#define RCC_APB1RSTR1_TIM5RST               (0x00000008)
#define RCC_APB1RSTR1_TIM6RST               (0x00000010)
#define RCC_APB1RSTR1_TIM7RST               (0x00000020)
#define RCC_APB1RSTR1_LCDRST                (0x00000200)
#define RCC_APB1RSTR1_SPI2RST               (0x00004000)
#define RCC_APB1RSTR1_SPI3RST               (0x00008000)
#define RCC_APB1RSTR1_USART2RST             (0x00020000)
#define RCC_APB1RSTR1_USART3RST             (0x00040000)
#define RCC_APB1RSTR1_UART4RST              (0x00080000)
#define RCC_APB1RSTR1_UART5RST              (0x00100000)
#define RCC_APB1RSTR1_I2C1RST               (0x00200000)
#define RCC_APB1RSTR1_I2C2RST               (0x00400000)
#define RCC_APB1RSTR1_I2C3RST               (0x00800000)
#define RCC_APB1RSTR1_CAN1RST               (0x02000000)
#define RCC_APB1RSTR1_USBRST                (0x04000000)
#define RCC_APB1RSTR1_PWRRST                (0x10000000)
#define RCC_APB1RSTR1_DAC1RST               (0x20000000)
#define RCC_APB1RSTR1_OPAMPRST              (0x40000000)
#define RCC_APB1RSTR1_LPTIM1RST             (0x80000000)

/*  Bit definition for RCC_APB1RSTR2 register  */
#define RCC_APB1RSTR2_LPUART1RST            (0x00000001)
#define RCC_APB1RSTR2_I2C41RST              (0x00000002)
#define RCC_APB1RSTR2_SWPMI1RST             (0x00000004)
#define RCC_APB1RSTR2_LPTIM2RST             (0x00000020)

/*  Bit definition for RCC_APB2RSTR register  */
#define RCC_APB2RSTR_SYSCFGRST              (0x00000001)
#define RCC_APB2RSTR_SDMMC1RST              (0x00000400)
#define RCC_APB2RSTR_TIM1RST                (0x00000800)
#define RCC_APB2RSTR_SPI1RST                (0x00001000)
#define RCC_APB2RSTR_USART1RST              (0x00004000)
#define RCC_APB2RSTR_TIM15RST               (0x00010000)
#define RCC_APB2RSTR_TIM16RST               (0x00020000)
#define RCC_APB2RSTR_SAI1RST                (0x00200000)
#define RCC_APB2RSTR_DFSDMRST               (0x01000000)

/*  Bit definition for RCC_AHB1ENR register  */
#define RCC_AHB1ENR_DMA1EN                  (0x00000001)
#define RCC_AHB1ENR_DMA2EN                  (0x00000002)
#define RCC_AHB1ENR_FLASHEN                 (0x00000100)
#define RCC_AHB1ENR_CRCEN                   (0x00001000)
#define RCC_AHB1ENR_TSCEN                   (0x00010000)

/*  Bit definition for RCC_AHB2ENR register  */
#define RCC_AHB2ENR_GPIOAEN                 (0x00000001)
#define RCC_AHB2ENR_GPIOBEN                 (0x00000002)
#define RCC_AHB2ENR_GPIOCEN                 (0x00000004)
#define RCC_AHB2ENR_GPIODEN                 (0x00000008)
#define RCC_AHB2ENR_GPIOEEN                 (0x00000010)
#define RCC_AHB2ENR_GPIOFEN                 (0x00000020)
#define RCC_AHB2ENR_GPIOGEN                 (0x00000040)
#define RCC_AHB2ENR_GPIOHEN                 (0x00000080)
#define RCC_AHB2ENR_OTGFSEN                 (0x00001000)
#define RCC_AHB2ENR_ADCEN                   (0x00002000)
#define RCC_AHB2ENR_RNGEN                   (0x00040000)

/*  Bit definition for RCC_AHB3ENR register  */
#define RCC_AHB3ENR_FMCEN                   (0x00000001)
#define RCC_AHB3ENR_QSPIEN                  (0x00000100)

/*  Bit definition for RCC_APB1ENR1 register  */
#define RCC_APB1ENR1_TIM2EN                 (0x00000001)
#define RCC_APB1ENR1_TIM3EN                 (0x00000002)
#define RCC_APB1ENR1_TIM4EN                 (0x00000004)
#define RCC_APB1ENR1_TIM5EN                 (0x00000008)
#define RCC_APB1ENR1_TIM6EN                 (0x00000010)
#define RCC_APB1ENR1_TIM7EN                 (0x00000020)
#define RCC_APB1ENR1_LCDEN                  (0x00000200)
#define RCC_APB1ENR1_WWDGEN                 (0x00000800)
#define RCC_APB1ENR1_SPI2EN                 (0x00004000)
#define RCC_APB1ENR1_SPI3EN                 (0x00008000)
#define RCC_APB1ENR1_USART2EN               (0x00020000)
#define RCC_APB1ENR1_USART3EN               (0x00040000)
#define RCC_APB1ENR1_UART4EN                (0x00080000)
#define RCC_APB1ENR1_UART5EN                (0x00100000)
#define RCC_APB1ENR1_I2C1EN                 (0x00200000)
#define RCC_APB1ENR1_I2C2EN                 (0x00400000)
#define RCC_APB1ENR1_I2C3EN                 (0x00800000)
#define RCC_APB1ENR1_CAN1EN                 (0x02000000)
#define RCC_APB1ENR1_USBEN                  (0x04000000)
#define RCC_APB1ENR1_PWREN                  (0x10000000)
#define RCC_APB1ENR1_DAC1EN                 (0x20000000)
#define RCC_APB1ENR1_OPAMPEN                (0x40000000)
#define RCC_APB1ENR1_LPTIM1EN               (0x80000000)

/*  Bit definition for RCC_APB1RSTR2 register  */
#define RCC_APB1ENR2_LPUART1EN              (0x00000001)
#define RCC_APB1ENR2_I2C4EN                 (0x00000002)
#define RCC_APB1ENR2_SWPMI1EN               (0x00000004)
#define RCC_APB1ENR2_LPTIM2EN               (0x00000020)

/*  Bit definition for RCC_APB2ENR register  */
#define RCC_APB2ENR_SYSCFGEN                (0x00000001)
#define RCC_APB2ENR_FWEN                    (0x00000080)
#define RCC_APB2ENR_SDMMC1EN                (0x00000400)
#define RCC_APB2ENR_TIM1EN                  (0x00000800)
#define RCC_APB2ENR_SPI1EN                  (0x00001000)
#define RCC_APB2ENR_TIM8EN                  (0x00002000)
#define RCC_APB2ENR_USART1EN                (0x00004000)
#define RCC_APB2ENR_TIM15EN                 (0x00010000)
#define RCC_APB2ENR_TIM16EN                 (0x00020000)
#define RCC_APB2ENR_SAI1EN                  (0x00200000)
#define RCC_APB2ENR_DFSDMEN                 (0x01000000)

