MightyDevices/startup-stm32l433/stm32l433/rcc.h
/*  Bit definition for RCC_AHB1SMENR register  */
#define RCC_AHB1SMENR_DMA1SMEN              (0x00000001)
#define RCC_AHB1SMENR_DMA2SMEN              (0x00000002)
#define RCC_AHB1SMENR_FLASHSMEN             (0x00000100)
#define RCC_AHB1SMENR_SRAM1SMEN             (0x00000200)
#define RCC_AHB1SMENR_CRCSMEN               (0x00001000)
#define RCC_AHB1SMENR_TSCSMEN               (0x00010000)

/*  Bit definition for RCC_AHB2SMENR register  */
#define RCC_AHB2SMENR_GPIOASMEN             (0x00000001)
#define RCC_AHB2SMENR_GPIOBSMEN             (0x00000002)
#define RCC_AHB2SMENR_GPIOCSMEN             (0x00000004)
#define RCC_AHB2SMENR_GPIODSMEN             (0x00000008)
#define RCC_AHB2SMENR_GPIOESMEN             (0x00000010)
#define RCC_AHB2SMENR_GPIOFSMEN             (0x00000020)
#define RCC_AHB2SMENR_GPIOGSMEN             (0x00000040)
#define RCC_AHB2SMENR_GPIOHSMEN             (0x00000080)
#define RCC_AHB2SMENR_SRAM2SMEN             (0x00000200)
#define RCC_AHB2SMENR_OTGFSSMEN             (0x00001000)
#define RCC_AHB2SMENR_ADCSMEN               (0x00002000)
#define RCC_AHB2SMENR_RNGSMEN               (0x00040000)

/*  Bit definition for RCC_AHB3SMENR register  */
#define RCC_AHB3SMENR_FMCSMEN               (0x00000001)
#define RCC_AHB3SMENR_QSPISMEN              (0x00000100)

/*  Bit definition for RCC_APB1SMENR1 register  */
#define RCC_APB1SMENR1_TIM2SMEN             (0x00000001)
#define RCC_APB1SMENR1_TIM3SMEN             (0x00000002)
#define RCC_APB1SMENR1_TIM4SMEN             (0x00000004)
#define RCC_APB1SMENR1_TIM5SMEN             (0x00000008)
#define RCC_APB1SMENR1_TIM6SMEN             (0x00000010)
#define RCC_APB1SMENR1_TIM7SMEN             (0x00000020)
#define RCC_APB1SMENR1_LCDSMEN              (0x00000200)
#define RCC_APB1SMENR1_WWDGSMEN             (0x00000800)
#define RCC_APB1SMENR1_SPI2SMEN             (0x00004000)
#define RCC_APB1SMENR1_SPI3SMEN             (0x00008000)
#define RCC_APB1SMENR1_USART2SMEN           (0x00020000)
#define RCC_APB1SMENR1_USART3SMEN           (0x00040000)
#define RCC_APB1SMENR1_UART4SMEN            (0x00080000)
#define RCC_APB1SMENR1_UART5SMEN            (0x00100000)
#define RCC_APB1SMENR1_I2C1SMEN             (0x00200000)
#define RCC_APB1SMENR1_I2C2SMEN             (0x00400000)
#define RCC_APB1SMENR1_I2C3SMEN             (0x00800000)
#define RCC_APB1SMENR1_CAN1SMEN             (0x02000000)
#define RCC_APB1SMENR1_USBFSSMEN            (0x04000000)
#define RCC_APB1SMENR1_PWRSMEN              (0x10000000)
#define RCC_APB1SMENR1_DAC1SMEN             (0x20000000)
#define RCC_APB1SMENR1_OPAMPSMEN            (0x40000000)
#define RCC_APB1SMENR1_LPTIM1SMEN           (0x80000000)

/*  Bit definition for RCC_APB1SMENR2 register  */
#define RCC_APB1SMENR2_LPUART1SMEN          (0x00000001)
#define RCC_APB1SMENR2_I2C4SMEN             (0x00000002)
#define RCC_APB1SMENR2_SWPMI1SMEN           (0x00000004)
#define RCC_APB1SMENR2_LPTIM2SMEN           (0x00000020)

/*  Bit definition for RCC_APB2SMENR register  */
#define RCC_APB2SMENR_SYSCFGSMEN            (0x00000001)
#define RCC_APB2SMENR_SDMMC1SMEN            (0x00000400)
#define RCC_APB2SMENR_TIM1SMEN              (0x00000800)
#define RCC_APB2SMENR_SPI1SMEN              (0x00001000)
#define RCC_APB2SMENR_TIM8SMEN              (0x00002000)
#define RCC_APB2SMENR_USART1SMEN            (0x00004000)
#define RCC_APB2SMENR_TIM15SMEN             (0x00010000)
#define RCC_APB2SMENR_TIM16SMEN             (0x00020000)
#define RCC_APB2SMENR_SAI1SMEN              (0x00200000)
#define RCC_APB2SMENR_DFSDMSMEN             (0x01000000)

/*  Bit definition for RCC_CCIPR register  */
#define RCC_CCIPR_USART1SEL                 (0x00000003)
#define RCC_CCIPR_USART1SEL_0               (0x00000001)
#define RCC_CCIPR_USART1SEL_1               (0x00000002)
#define RCC_CCIPR_USART2SEL                 (0x0000000C)
#define RCC_CCIPR_USART2SEL_0               (0x00000004)
#define RCC_CCIPR_USART2SEL_1               (0x00000008)
#define RCC_CCIPR_USART3SEL                 (0x00000030)
#define RCC_CCIPR_USART3SEL_0               (0x00000010)
#define RCC_CCIPR_USART3SEL_1               (0x00000020)
#define RCC_CCIPR_UART4SEL                  (0x000000C0)
#define RCC_CCIPR_UART4SEL_0                (0x00000040)
#define RCC_CCIPR_UART4SEL_1                (0x00000080)
#define RCC_CCIPR_UART5SEL                  (0x00000300)
#define RCC_CCIPR_UART5SEL_0                (0x00000100)
#define RCC_CCIPR_UART5SEL_1                (0x00000200)
#define RCC_CCIPR_LPUART1SEL                (0x00000C00)
#define RCC_CCIPR_LPUART1SEL_0              (0x00000400)
#define RCC_CCIPR_LPUART1SEL_1              (0x00000800)
#define RCC_CCIPR_I2C1SEL                   (0x00003000)
#define RCC_CCIPR_I2C1SEL_0                 (0x00001000)
#define RCC_CCIPR_I2C1SEL_1                 (0x00002000)
#define RCC_CCIPR_I2C2SEL                   (0x0000C000)
#define RCC_CCIPR_I2C2SEL_0                 (0x00004000)
#define RCC_CCIPR_I2C2SEL_1                 (0x00008000)
#define RCC_CCIPR_I2C3SEL                   (0x00030000)
#define RCC_CCIPR_I2C3SEL_0                 (0x00010000)
#define RCC_CCIPR_I2C3SEL_1                 (0x00020000)
#define RCC_CCIPR_LPTIM1SEL                 (0x000C0000)
#define RCC_CCIPR_LPTIM1SEL_0               (0x00040000)
#define RCC_CCIPR_LPTIM1SEL_1               (0x00080000)
#define RCC_CCIPR_LPTIM2SEL                 (0x00300000)
#define RCC_CCIPR_LPTIM2SEL_0               (0x00100000)
#define RCC_CCIPR_LPTIM2SEL_1               (0x00200000)
#define RCC_CCIPR_SAI1SEL                   (0x00C00000)
#define RCC_CCIPR_SAI1SEL_0                 (0x00400000)
#define RCC_CCIPR_SAI1SEL_1                 (0x00800000)
#define RCC_CCIPR_CLK48SEL                  (0x0C000000)
#define RCC_CCIPR_CLK48SEL_0                (0x04000000)
#define RCC_CCIPR_CLK48SEL_1                (0x08000000)
#define RCC_CCIPR_ADCSEL                    (0x30000000)
#define RCC_CCIPR_ADCSEL_0                  (0x10000000)
#define RCC_CCIPR_ADCSEL_1                  (0x20000000)
#define RCC_CCIPR_SWPMI1SEL                 (0x40000000)
#define RCC_CCIPR_DFSDMSEL                  (0x80000000)

/*  Bit definition for RCC_BDCR register  */
#define RCC_BDCR_LSEON                      (0x00000001)
#define RCC_BDCR_LSERDY                     (0x00000002)
#define RCC_BDCR_LSEBYP                     (0x00000004)
#define RCC_BDCR_LSEDRV                     (0x00000018)
#define RCC_BDCR_LSEDRV_0                   (0x00000008)
#define RCC_BDCR_LSEDRV_1                   (0x00000010)
#define RCC_BDCR_LSECSSON                   (0x00000020)
#define RCC_BDCR_LSECSSD                    (0x00000040)
#define RCC_BDCR_RTCSEL                     (0x00000300)
#define RCC_BDCR_RTCSEL_0                   (0x00000100)
#define RCC_BDCR_RTCSEL_1                   (0x00000200)
#define RCC_BDCR_RTCEN                      (0x00008000)
#define RCC_BDCR_BDRST                      (0x00010000)
#define RCC_BDCR_LSCOEN                     (0x01000000)
#define RCC_BDCR_LSCOSEL                    (0x02000000)

/*  Bit definition for RCC_CSR register  */
#define RCC_CSR_LSION                       (0x00000001)
#define RCC_CSR_LSIRDY                      (0x00000002)
#define RCC_CSR_MSISRANGE                   (0x00000F00)
#define RCC_CSR_MSISRANGE_1                 (0x00000400)
#define RCC_CSR_MSISRANGE_2                 (0x00000500)
#define RCC_CSR_MSISRANGE_4                 (0x00000600)
#define RCC_CSR_MSISRANGE_8                 (0x00000700)
#define RCC_CSR_RMVF                        (0x00800000)
#define RCC_CSR_FWRSTF                      (0x01000000)
#define RCC_CSR_OBLRSTF                     (0x02000000)
#define RCC_CSR_PINRSTF                     (0x04000000)
#define RCC_CSR_BORRSTF                     (0x08000000)
#define RCC_CSR_SFTRSTF                     (0x10000000)
#define RCC_CSR_IWDGRSTF                    (0x20000000)
#define RCC_CSR_WWDGRSTF                    (0x40000000)
#define RCC_CSR_LPWRRSTF                    (0x80000000)

/*  Bit definition for RCC_CRCCR register  */
#define RCC_CRRCR_HSI48ON                   (0x00000001)
#define RCC_CRRCR_HSI48RDY                  (0x00000002)
#define RCC_CRRCR_HSI48CAL                  (0x00007F80)

/*  Bit definition for RCC_CCIPR2 register  */
#define RCC_CCIPR2_I2C4SEL                  (0x00000003)
#define RCC_CCIPR2_I2C4SEL_0                (0x00000001)
#define RCC_CCIPR2_I2C4SEL_1                (0x00000002)

#endif /* STM32L433_RCC_H_ */
